

#ifndef PLATFORMNTO1_H_
#define PLATFORMNTO1_H_

#include "stdio.h"
#include "tistdtypes.h"
#include "cslr_device.h"
#include "cslr_uart.h"
#include "cslr_tpcc.h"
#include <cslr_cgem.h>
/*************************************************************************************************************/
//lib版本查询
/*************************************************************************************************************/
/*****************************************************************************
 Prototype    : LibVersion
 Description  : lib当前版本查询。
 Input        : 无
 Output       : 无
 Return Value : unsigned int，版本号。
*****************************************************************************/
extern unsigned int LibVersion(void);

/*************************************************************************************************************/
//设备平台硬件初始化
/*************************************************************************************************************/


/*****************************************************************************
 Prototype    : PlatformNto1_Init
 Description  : 平台初始化函数，包括mainPLL、DDR3初始化，配置为内核时钟1000MHz，DDR3为1000MHz。
 Input        : 无
 Output       : 无
 Return Value : 1为初始化成功。
*****************************************************************************/
extern int PlatformNto1_Init(void);






#endif /* PLATFORMNTO1_H_ */
